In [3]:
pwd

'C:\\Users\\sushant\\Desktop\\ML\\2_Pandas'

# Needed Libraries
## lxml, html5lib, BeautifulSoup4

In [4]:
import numpy as np

In [5]:
import pandas as pd

In [7]:
myFrame = pd.read_csv('example-csv.csv')

In [8]:
myFrame

      1     2     3
0    11    22    33
1   111   222   333
2  1111  2222  3333

In [21]:
myFrame.to_csv('example-output.csv', index=False)

In [22]:
pd.read_csv('example-output.csv')

      1     2     3
0    11    22    33
1   111   222   333
2  1111  2222  3333

In [25]:
pd.read_excel('example-excel.xlsx')

       1      2      3
0     11     22     33
1    111    222    333
2   1111   2222   3333
3  11111  22222  33333

In [30]:
myExcelSheet =pd.read_excel('example-excel.xlsx', sheet_name='squadsheet')

In [31]:
myExcelSheet

   0  1
0  1  2
1  3  4

In [39]:
myExcelSheet.to_excel('example-excel-output.xlsx', sheet_name='squadsheet', index=False)

In [40]:
pd.read_excel('example-excel-output.xlsx', sheet_name='squadsheet')

   0  1
0  1  2
1  3  4